src/InformationRegisters/ОтветственныеЗаИБ/ОтветственныеЗаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЗаИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтветственныеЗаПодключенияИБ/ОтветственныеЗаПодключенияИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЗаПодключенияИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтветственныеЗаРасширенияКонфигураций/ОтветственныеЗаРасширенияКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЗаРасширенияКонфигураций</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасширениеКонфигурации</name>
    <type>
      <types>CatalogRef.РасширенияКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ОтветственныеЛица/ОтветственныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОтветственныеЛица</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОтветственныеЛица/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает актуальный состав ответственных лиц за информационную базу и организацию на указанную дату
//
// Параметры:
//   ДатаРасчета - Дата - дата, на которую определяется актуальный состав
//   Организация - СправочникСсылка.Организации - организация, для которой формируется состав
//   ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база, для которой формируется состав
//   Неопределено - если не указана, возвращаются ответственные только на уровне организации
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Организация - СправочникСсылка.Организации - организация
//     * ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//     * Ответственный - СправочникСсылка.ОтветственныеЛица - ответственное лицо
//     * Email - Строка - email ответственного лица
//     * Телефон - Строка - телефон ответственного лица
//     * ДатаНазначения - Дата - дата назначения ответственного лица
//     * Источник - Строка - источник ответственного ("Организация" или "ИнформационнаяБаза")
Функция ПолучитьАктуальныйСостав(ДатаРасчета, Организация, ИнформационнаяБаза = Неопределено) Экспорт
	
	ПустаяИБ = Справочники.ИнформационныеБазы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяИБ", ПустаяИБ);
	
	Если ИнформационнаяБаза = Неопределено Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	&Организация КАК Организация,
			|	&ПустаяИБ КАК ИнформационнаяБаза,
			|	ОтветственныеЗаИБСрезПоследних.Ответственный КАК Ответственный,
			|	ОтветственныеЛица.Email КАК Email,
			|	ОтветственныеЛица.Телефон КАК Телефон,
			|	ОтветственныеЗаИБСрезПоследних.Период КАК ДатаНазначения,
			|	""Организация"" КАК Источник
			|ИЗ
			|	РегистрСведений.ОтветственныеЗаИБ.СрезПоследних(
			|			&ДатаРасчета,
			|			Организация = &Организация
			|				И ИнформационнаяБаза = &ПустаяИБ) КАК ОтветственныеЗаИБСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
			|		ПО ОтветственныеЗаИБСрезПоследних.Ответственный = ОтветственныеЛица.Ссылка
			|ГДЕ
			|	НЕ ОтветственныеЗаИБСрезПоследних.Исключить
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаНазначения";
		
	Иначе
		
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Сортировка.Организация КАК Организация,
			|	Сортировка.ИнформационнаяБаза КАК ИнформационнаяБаза,
			|	Сортировка.Ответственный КАК Ответственный,
			|	Сортировка.Email КАК Email,
			|	Сортировка.Телефон КАК Телефон,
			|	Сортировка.ДатаНазначения КАК ДатаНазначения,
			|	Сортировка.Источник КАК Источник
			|ИЗ
			|	(ВЫБРАТЬ
			|		&Организация КАК Организация,
			|		&ИнформационнаяБаза КАК ИнформационнаяБаза,
			|		ЛокальныйСрез.Ответственный КАК Ответственный,
			|		ОтветственныеЛица.Email КАК Email,
			|		ОтветственныеЛица.Телефон КАК Телефон,
			|		ЛокальныйСрез.Период КАК ДатаНазначения,
			|		""ИнформационнаяБаза"" КАК Источник
			|	ИЗ
			|		РегистрСведений.ОтветственныеЗаИБ.СрезПоследних(
			|				&ДатаРасчета,
			|				Организация = &Организация
			|					И ИнформационнаяБаза = &ИнформационнаяБаза) КАК ЛокальныйСрез
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
			|			ПО ЛокальныйСрез.Ответственный = ОтветственныеЛица.Ссылка
			|	ГДЕ
			|		НЕ ЛокальныйСрез.Исключить
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&Организация,
			|		&ПустаяИБ,
			|		БазовыйСрез.Ответственный,
			|		ОтветственныеЛица.Email,
			|		ОтветственныеЛица.Телефон,
			|		БазовыйСрез.Период,
			|		""Организация""
			|	ИЗ
			|		РегистрСведений.ОтветственныеЗаИБ.СрезПоследних(
			|				&ДатаРасчета,
			|				Организация = &Организация
			|					И ИнформационнаяБаза = &ПустаяИБ) КАК БазовыйСрез
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
			|			ПО БазовыйСрез.Ответственный = ОтветственныеЛица.Ссылка
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаИБ.СрезПоследних(
			|					&ДатаРасчета,
			|					Организация = &Организация
			|						И ИнформационнаяБаза = &ИнформационнаяБаза) КАК ЛокальныйСрезПроверка
			|			ПО БазовыйСрез.Ответственный = ЛокальныйСрезПроверка.Ответственный
			|	ГДЕ
			|		НЕ БазовыйСрез.Исключить
			|		И ЛокальныйСрезПроверка.Ответственный ЕСТЬ NULL) КАК Сортировка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Источник УБЫВ,
			|	ДатаНазначения";
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу ответственных за подключение к информационным базам на указанную дату
//
// Параметры:
//   ДатаРасчета - Дата - дата, на которую необходимо получить актуальный состав ответственных
//   Организация - СправочникСсылка.Организации - организация, для которой определяется ответственный
//   ИнформационнаяБаза - Неопределено - если не указана, то возвращаются ответственные на уровне организации
//                      - СправочникСсылка.ИнформационныеБазы - конкретная информационная база, для которой ищется ответственный
//
// Возвращаемое значение:
//   ТаблицаЗначений - информация об ответственных лицах:
//     * Организация - СправочникСсылка.Организации - организация ответственного
//     * ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//     * Ответственный - СправочникСсылка.ОтветственныеЛица - ответственный за подключение
//     * Email - Строка - email ответственного
//     * Телефон - Строка - телефон ответственного
//     * ДатаНазначения - Дата - дата назначения ответственного
//     * Источник - Строка - источник данных: "Организация" или "ИнформационнаяБаза"
Функция ПолучитьАктуальныйСоставПодключение(ДатаРасчета, Организация, ИнформационнаяБаза = Неопределено) Экспорт
	
	ПустаяИБ = Справочники.ИнформационныеБазы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяИБ", ПустаяИБ);
	
	Если ИнформационнаяБаза = Неопределено Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	&Организация КАК Организация,
			|	&ПустаяИБ КАК ИнформационнаяБаза,
			|	ОтветственныеЗаПодключенияИБСрезПоследних.Ответственный КАК Ответственный,
			|	ОтветственныеЛица.Email КАК Email,
			|	ОтветственныеЛица.Телефон КАК Телефон,
			|	ОтветственныеЗаПодключенияИБСрезПоследних.Период КАК ДатаНазначения,
			|	""Организация"" КАК Источник
			|ИЗ
			|	РегистрСведений.ОтветственныеЗаПодключенияИБ.СрезПоследних(
			|			&ДатаРасчета,
			|			Организация = &Организация
			|				И ИнформационнаяБаза = &ПустаяИБ) КАК ОтветственныеЗаПодключенияИБСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
			|		ПО ОтветственныеЗаПодключенияИБСрезПоследних.Ответственный = ОтветственныеЛица.Ссылка
			|ГДЕ
			|	НЕ ОтветственныеЗаПодключенияИБСрезПоследних.Исключить
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаНазначения";
		
	Иначе
		
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Сортировка.Организация КАК Организация,
			|	Сортировка.ИнформационнаяБаза КАК ИнформационнаяБаза,
			|	Сортировка.Ответственный КАК Ответственный,
			|	Сортировка.Email КАК Email,
			|	Сортировка.Телефон КАК Телефон,
			|	Сортировка.ДатаНазначения КАК ДатаНазначения,
			|	Сортировка.Источник КАК Источник
			|ИЗ
			|	(ВЫБРАТЬ
			|		&Организация КАК Организация,
			|		&ИнформационнаяБаза КАК ИнформационнаяБаза,
			|		ЛокальныйСрез.Ответственный КАК Ответственный,
			|		ОтветственныеЛица.Email КАК Email,
			|		ОтветственныеЛица.Телефон КАК Телефон,
			|		ЛокальныйСрез.Период КАК ДатаНазначения,
			|		""ИнформационнаяБаза"" КАК Источник
			|	ИЗ
			|		РегистрСведений.ОтветственныеЗаПодключенияИБ.СрезПоследних(
			|				&ДатаРасчета,
			|				Организация = &Организация
			|					И ИнформационнаяБаза = &ИнформационнаяБаза) КАК ЛокальныйСрез
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
			|			ПО ЛокальныйСрез.Ответственный = ОтветственныеЛица.Ссылка
			|	ГДЕ
			|		НЕ ЛокальныйСрез.Исключить
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&Организация,
			|		&ПустаяИБ,
			|		БазовыйСрез.Ответственный,
			|		ОтветственныеЛица.Email,
			|		ОтветственныеЛица.Телефон,
			|		БазовыйСрез.Период,
			|		""Организация""
			|	ИЗ
			|		РегистрСведений.ОтветственныеЗаПодключенияИБ.СрезПоследних(
			|				&ДатаРасчета,
			|				Организация = &Организация
			|					И ИнформационнаяБаза = &ПустаяИБ) КАК БазовыйСрез
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
			|			ПО БазовыйСрез.Ответственный = ОтветственныеЛица.Ссылка
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаИБ.СрезПоследних(
			|					&ДатаРасчета,
			|					Организация = &Организация
			|						И ИнформационнаяБаза = &ИнформационнаяБаза) КАК ЛокальныйСрезПроверка
			|			ПО БазовыйСрез.Ответственный = ЛокальныйСрезПроверка.Ответственный
			|	ГДЕ
			|		НЕ БазовыйСрез.Исключить
			|		И ЛокальныйСрезПроверка.Ответственный ЕСТЬ NULL) КАК Сортировка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Источник УБЫВ,
			|	ДатаНазначения";
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Обновляет состав ответственных лиц за информационную базу, добавляя новых и помечая удаленных
//
// Параметры:
//   ДатаРасчета - Дата - дата, на которую записывается состав
//   НовыйСостав - ТаблицаЗначений - новый состав ответственных лиц, см. ПолучитьАктуальныйСостав
//   Организация - СправочникСсылка.Организации - организация, для которой записывается состав
//   ИнформационнаяБаза - Неопределено - если не указана, записываются ответственные только на уровне организации
//                      - СправочникСсылка.ИнформационныеБазы - конкретная информационная база, для которой записывается состав
Процедура ЗаписатьСостав(ДатаРасчета, НовыйСостав, Организация, ИнформационнаяБаза = Неопределено) Экспорт
	
	ТекущийСостав = ПолучитьАктуальныйСостав(ДатаРасчета, Организация, ИнформационнаяБаза);
	
	НовыйСостав.Индексы.Добавить("Ответственный");
	ТекущийСостав.Индексы.Добавить("Ответственный");
	
	Добавленные = Новый Массив;
	Для Каждого СтрокаНовый Из НовыйСостав Цикл
		Отбор = Новый Структура("Ответственный", СтрокаНовый.Ответственный);
		Если ТекущийСостав.НайтиСтроки(Отбор).Количество() = 0 Тогда
			Добавленные.Добавить(СтрокаНовый);
		КонецЕсли;
	КонецЦикла;
	
	Удаленные = Новый Массив;
	Для Каждого СтрокаТекущий Из ТекущийСостав Цикл
		Отбор = Новый Структура("Ответственный", СтрокаТекущий.Ответственный);
		Если НовыйСостав.НайтиСтроки(Отбор).Количество() = 0 Тогда
			Удаленные.Добавить(СтрокаТекущий);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДобавленный Из Добавленные Цикл
		ЗаписатьОтветственногоЗаИБ(ДатаРасчета, Организация, ИнформационнаяБаза, СтрокаДобавленный.Ответственный, Ложь);
	КонецЦикла;
	
	Для Каждого СтрокаУдаленный Из Удаленные Цикл
		ЗаписатьОтветственногоЗаИБ(ДатаРасчета, Организация, ИнформационнаяБаза, СтрокаУдаленный.Ответственный, Истина);
	КонецЦикла;
	
КонецПроцедуры

// Обновляет состав ответственных лиц за подключение к информационной базе, добавляя новых и помечая удаленных
//
// Параметры:
//   ДатаРасчета - Дата - дата, на которую записывается состав
//   НовыйСостав - ТаблицаЗначений - новый состав ответственных лиц, см. ПолучитьАктуальныйСоставПодключение
//   Организация - СправочникСсылка.Организации
//   ИнформационнаяБаза - Неопределено - если не указана, записываются ответственные только на уровне организации
//                      - СправочникСсылка.ИнформационныеБазы
Процедура ЗаписатьСоставПодключение(ДатаРасчета, НовыйСостав, Организация, ИнформационнаяБаза = Неопределено) Экспорт
	
	ТекущийСостав = ПолучитьАктуальныйСоставПодключение(ДатаРасчета, Организация, ИнформационнаяБаза);
	
	НовыйСостав.Индексы.Добавить("Ответственный");
	ТекущийСостав.Индексы.Добавить("Ответственный");
	
	Добавленные = Новый Массив;
	Для Каждого СтрокаНовый Из НовыйСостав Цикл
		Отбор = Новый Структура("Ответственный", СтрокаНовый.Ответственный);
		Если ТекущийСостав.НайтиСтроки(Отбор).Количество() = 0 Тогда
			Добавленные.Добавить(СтрокаНовый);
		КонецЕсли;
	КонецЦикла;
	
	Удаленные = Новый Массив;
	Для Каждого СтрокаТекущий Из ТекущийСостав Цикл
		Отбор = Новый Структура("Ответственный", СтрокаТекущий.Ответственный);
		Если НовыйСостав.НайтиСтроки(Отбор).Количество() = 0 Тогда
			Удаленные.Добавить(СтрокаТекущий);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДобавленный Из Добавленные Цикл
		ЗаписатьОтветственногоЗаПодключениеИБ(ДатаРасчета, Организация, ИнформационнаяБаза, СтрокаДобавленный.Ответственный, Ложь);
	КонецЦикла;
	
	Для Каждого СтрокаУдаленный Из Удаленные Цикл
		ЗаписатьОтветственногоЗаПодключениеИБ(ДатаРасчета, Организация, ИнформационнаяБаза, СтрокаУдаленный.Ответственный, Истина);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает контактные данные (email, телефон) ответственного лица
//
// Параметры:
//   Ответственный - СправочникСсылка.ОтветственныеЛица - ссылка на объект ответственного
//
// Возвращаемое значение:
//   Структура:
//     * Email - Строка - email-адрес
//     * Телефон - Строка - номер телефона
Функция ПолучитьКонтактныеДанные(Ответственный) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответственный, "Email, Телефон");
	
КонецФункции 

// Возвращает актуальный состав ответственных за расширение конфигурации для указанной информационной базы
//
// Параметры:
//   Расширение - СправочникСсылка.РасширенияКонфигураций - расширение конфигурации
//   ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Организация - СправочникСсылка.Организации - организация информационной базы
//     * ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//     * РасширениеКонфигурации - СправочникСсылка.РасширенияКонфигураций - расширение конфигурации
//     * Ответственный - СправочникСсылка.ОтветственныеЛица - ответственный за расширение
//     * Email - Строка - email ответственного
//     * Телефон - Строка - телефон ответственного
//     * Источник - Строка - источник данных (значение "Расширение")
Функция ПолучитьАктуальныйСоставЗаРасширение(Расширение, ИнформационнаяБаза) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Расширение", Расширение);
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИБ.Организация КАК Организация,
		|	Регистр.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Регистр.РасширениеКонфигурации КАК РасширениеКонфигурации,
		|	Регистр.Ответственный КАК Ответственный,
		|	ОтветственныеЛица.Email КАК Email,
		|	ОтветственныеЛица.Телефон КАК Телефон,
		|	""Расширение"" КАК Источник
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаРасширенияКонфигураций КАК Регистр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИБ
		|		ПО Регистр.ИнформационнаяБаза = ИБ.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
		|		ПО Регистр.Ответственный = ОтветственныеЛица.Ссылка
		|ГДЕ
		|	Регистр.ИнформационнаяБаза = &ИнформационнаяБаза
		|	И Регистр.РасширениеКонфигурации = &Расширение";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает информацию о всех ответственных лицах за расширения конфигурации указанной информационной базы
//
// Параметры:
//   ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - ссылка на информационную базу
//
// Возвращаемое значение:
//   ТаблицаЗначений - список ответственных за расширения конфигурации:
//     * Организация - СправочникСсылка.Организации - организация информационной базы
//     * ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//     * РасширениеКонфигурации - СправочникСсылка.РасширенияКонфигураций - расширение конфигурации
//     * Ответственный - СправочникСсылка.ОтветственныеЛица - ответственное лицо
//     * Email - Строка - электронная почта ответственного
//     * Телефон - Строка - телефон ответственного
//     * Источник - Строка - тип источника ответственности (значение "Расширение")
Функция ПолучитьВсехОтветственныхЗаРасширенияИБ(ИнформационнаяБаза) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИБ.Организация КАК Организация,
		|	Регистр.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Регистр.РасширениеКонфигурации КАК РасширениеКонфигурации,
		|	Регистр.Ответственный КАК Ответственный,
		|	ОтветственныеЛица.Email КАК Email,
		|	ОтветственныеЛица.Телефон КАК Телефон,
		|	""Расширение"" КАК Источник
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаРасширенияКонфигураций КАК Регистр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИБ
		|		ПО Регистр.ИнформационнаяБаза = ИБ.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
		|		ПО Регистр.Ответственный = ОтветственныеЛица.Ссылка
		|ГДЕ
		|	Регистр.ИнформационнаяБаза = &ИнформационнаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасширениеКонфигурации";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает всех ответственных за расширения для списка ИБ
//
// Параметры:
//   СписокИБ - Массив из СправочникСсылка.ИнформационныеБазы - список ИБ
//   ДатаРасчета - Дата - дата, на которую определяется состав
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//     * РасширениеКонфигурации - СправочникСсылка.РасширенияКонфигураций - расширение конфигурации
//     * Ответственный - СправочникСсылка.ОтветственныеЛица - ответственный за расширение
//     * Email - Строка - email ответственного
//     * Телефон - Строка - телефон ответственного
//     * Источник - Строка - источник данных (значение "Расширение")
//     * Организация - СправочникСсылка.Организации - организация информационной базы
Функция ПолучитьОтветственныхЗаРасширенияПоСпискуИБ(СписокИБ, ДатаРасчета) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИнформационнаяБаза");
	Результат.Колонки.Добавить("РасширениеКонфигурации");
	Результат.Колонки.Добавить("Ответственный");
	Результат.Колонки.Добавить("Email");
	Результат.Колонки.Добавить("Телефон");
	Результат.Колонки.Добавить("Источник");
	Результат.Колонки.Добавить("Организация");
	
	Для Каждого ИБ Из СписокИБ Цикл
		СоставПоИБ = ПолучитьВсехОтветственныхЗаРасширенияИБ(ИБ);
		Для Каждого Строка Из СоставПоИБ Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ИнформационнаяБаза = Строка.ИнформационнаяБаза;
			НоваяСтрока.РасширениеКонфигурации = Строка.РасширениеКонфигурации;
			НоваяСтрока.Ответственный = Строка.Ответственный;
			НоваяСтрока.Email = Строка.Email;
			НоваяСтрока.Телефон = Строка.Телефон;
			НоваяСтрока.Источник = "Расширение";
			НоваяСтрока.Организация = Строка.Организация;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Записывает ответственных за расширения конфигурации в регистр сведений с замещением предыдущих записей
//
// Параметры:
//   ОбщийСостав - ТаблицаЗначений - таблица, содержащая состав ответственных за расширения, см. ПолучитьВсехОтветственныхЗаРасширенияИБ
//   ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - информационная база
//   Организация - СправочникСсылка.Организации - организация
Процедура ЗаписатьВсехОтветственныхЗаРасширенияИБ(ОбщийСостав, ИнформационнаяБаза, Организация) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОтветственныеЗаРасширенияКонфигураций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
		
	Для Каждого СтрокаСостава Из ОбщийСостав Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Организация = Организация;
		Запись.ИнформационнаяБаза = ИнформационнаяБаза;
		Запись.РасширениеКонфигурации = СтрокаСостава.РасширениеКонфигурации;
		Запись.Ответственный = СтрокаСостава.Ответственный;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОтветственногоЗаИБ(ДатаРасчета, Организация, ИнформационнаяБаза, Ответственный, Исключить)
	
	ПустаяИБ = Справочники.ИнформационныеБазы.ПустаяСсылка();
	
	Запись = РегистрыСведений.ОтветственныеЗаИБ.СоздатьМенеджерЗаписи();
	Запись.Период = ДатаРасчета;
	Запись.Организация = Организация;
	
	Если ИнформационнаяБаза <> Неопределено Тогда
		Запись.ИнформационнаяБаза = ИнформационнаяБаза;
	Иначе
		Запись.ИнформационнаяБаза = ПустаяИБ;
	КонецЕсли;
	
	Запись.Ответственный = Ответственный;
	Запись.Исключить = Исключить;
	Запись.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаписатьОтветственногоЗаПодключениеИБ(ДатаРасчета, Организация, ИнформационнаяБаза, Ответственный, Исключить)
	
	ПустаяИБ = Справочники.ИнформационныеБазы.ПустаяСсылка();
	
	Запись = РегистрыСведений.ОтветственныеЗаПодключенияИБ.СоздатьМенеджерЗаписи();
	Запись.Период = ДатаРасчета;
	Запись.Организация = Организация;
	
	Если ИнформационнаяБаза <> Неопределено Тогда
		Запись.ИнформационнаяБаза = ИнформационнаяБаза;
	Иначе
		Запись.ИнформационнаяБаза = ПустаяИБ;
	КонецЕсли;
	
	Запись.Ответственный = Ответственный;
	Запись.Исключить = Исключить;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
